
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВакансияНомерВакансии
	Движения.ВакансияНомерКомпанияВакансии.Записывать = Истина;
	Движение = Движения.ВакансияНомерКомпанияВакансии.Добавить();
	Движение.СайтыВладельцы = СайтВладелец;
	Движение.НомерHH = НомерHH;
	//Движение.НомерHHРаботодателя = Работодатель.НомерHH;
	Движение.Работодатель = Работодатель;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


