
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Если ЗначениеЗаполнено(ЭтаФорма.Параметры.ВакансияИзЖурнала) Тогда
				ДанныеВакансии = ЭтаФорма.Параметры.ВакансияИзЖурнала;					
				Объект.Вакансия = ДанныеВакансии;
				Объект.Компания = ДанныеВакансии.Работодатель;
				Объект.Статус = Перечисления.СтатусОтклика.НовоеПриглашение;
				ЗаполнитьЗначенияСвойств(Объект,ДанныеВакансии);
				Объект.Дата = ТекущаяДата();
			КонецЕсли;	
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры
