
&НаСервере
Процедура ОбработкаВыбораНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	
	ОбработкаВыбораНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "СсылкаURLСсылка" Тогда
		СтандартнаяОбработка = Ложь;
		ПерейтиПоНавигационнойСсылке(Элемент.ТекущиеДанные.URLСсылка);	
		Возврат;
	КонецЕсли;	
	П = Новый Структура;
	Если Поле.Имя = "СсылкаРаботодатель" Тогда
		П.Вставить("Ключ", Элемент.ТекущиеДанные.СсылкаРаботодатель);	
		ОткрытьФорму("Справочник.Работодатели.ФормаОбъекта",П);
	Иначе	
		П.Вставить("Ключ", Элемент.ТекущиеДанные.Ссылка);	
		ОткрытьФорму("Документ.Вакансии.ФормаОбъекта", П);
	КонецЕсли;	
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьЗначениеСсылки(ОбъектССылка,Значение)
	Возврат ОбъектССылка[Значение];
КонецФункции

&НаКлиенте
Процедура НеИнтересно(Команда)
	ПометитьНаУдаление(Элементы.Список.ТекущиеДанные.Ссылка);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПометитьНаУдаление(ОбъектССылка)
	
	ПометимЕго = ОбъектССылка.ПолучитьОбъект();
	ПометимЕго.УстановитьПометкуУдаления(Истина);
КонецФункции

&НаКлиенте
Процедура БылОтклик(Команда)
	П = Новый Структура;
	П.Вставить("ВакансияИзЖурнала", Элементы.Список.ТекущиеДанные.Ссылка);
	
	ОткрытьФорму("Документ.Отклики.ФормаОбъекта",П,);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура БылОткликНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура НеПодходитНаСервере(НеПодххх)
	НеПодхоитСерв = НеПодххх.ПолучитьОбъект();
	НеПодхоитСерв.НеПодходит =Истина;
	НеПодхоитСерв.Записать();
КонецПроцедуры

&НаКлиенте
Процедура НеПодходит(Команда)
	НеПодходитНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ИнтереснаяВакансияНаСервере(Интересн)
	НеПодхоитСерв = Интересн.ПолучитьОбъект();
	НеПодхоитСерв.ИнтереснаяВакансия =Истина;
	НеПодхоитСерв.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнтереснаяВакансия(Команда)
	ИнтереснаяВакансияНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	Элементы.Список.Обновить();
КонецПроцедуры


//&НаКлиенте
//Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//	Если Поле.Имя = "СсылкаНаЖилье" Тогда
//	СтандартнаяОбработка = Ложь;
//	ПерейтиПоНавигационнойСсылке(Элемент.ТекущиеДанные.СсылкаНаЖилье)		
//		
//	КонецЕсли;	
//КонецПроцедуры


//&НаКлиенте
//Процедура СсылкаНаЖильеОткрытие(Элемент, СтандартнаяОбработка)
//	СтандартнаяОбработка = Ложь;
//	ПерейтиПоНавигационнойСсылке(Элемент.ТекстРедактирования)
//КонецПроцедуры
