
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Попытка
	ВакансияК = Вакансия.ПолучитьОбъект();
	ВакансияК.БылОтклик = Истина;
	ВакансияК.Записать();
	Исключение
	КонецПопытки;
	
	
	Если Статус <> Перечисления.СтатусОтклика.НовоеПриглашение
	и Статус <> Перечисления.СтатусОтклика.Отклонил Тогда
	Движения.ЗапланированныеВстречи.Записывать = Истина;
	Движение = Движения.ЗапланированныеВстречи.Добавить();
	Движение.Период = Дата;
	Движение.Статус = Статус;
	Движение.ДатаИВремяСобеседования = ДатаИВремяСобеседования;
	Движение.Адрес = Адрес;
	Движение.Схема = СхемаПроездаВПисьме;
	Иначе
	Движения.ЗапланированныеВстречи.Очистить();
	Движения.ЗапланированныеВстречи.Записать();
	
	КонецЕсли;	
		

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗапланированныеВстречи

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
